<template>
  <div class="box" ref="map">

  </div>
</template>

<script setup lang="ts">
import { ref, onMounted } from 'vue';
import * as Echarts from 'echarts'
import chinaJson from './china.json'
let map = ref<HTMLDivElement>()
Echarts.registerMap('china', chinaJson as any)
onMounted(() => {
  let myEcharts = Echarts.init(map.value as HTMLDivElement)
  myEcharts.setOption({
    // 地图组件
    geo: {
      map: 'china',// 注册地图组件时使用的名称
      roam: true,// 是否开启鼠标缩放和平移漫游
      //地图的位置调试
      left: 150,
      top: 180,
      right: 150,
      zoom: 1.4,// 地图的放大与缩小比例
      bottom: 0,
      label: {// 图形上的文本的一些设置
        show: true,
        color: 'white'
      },
      itemStyle: {
        borderColor: 'rgba(147, 235, 248, 1)',
        borderWidth: 1,
        areaColor: {
          type: 'radial',
          x: 0.5,
          y: 0.5,
          r: 0.8,
          colorStops: [{
            offset: 0,
            color: 'rgba(147, 235, 248, 0)' // 0% 处的颜色
          }, {
            offset: 1,
            color: 'rgba(147, 235, 248, 0.2)' // 100% 处的颜色
          }],
          globalCoord: false // 缺省为 false
        },
        shadowColor: 'rgba(128, 217, 248, 1)',
        shadowOffsetX: -2,
        shadowOffsetY: 2,
        shadowBlur: 10
      },
      emphasis: {
        itemStyle: {
          opacity: 0.5,
          color: 'red'
        },
        label: {
          fontSize: 40,
          color: 'white'
        }
      }
    },
    series: [
      {
        type: 'lines',
        // 动画特效
        effect: {
          show: true,
          period: 4, //箭头指向速度，值越小速度越快
          trailLength: 0.01, //特效尾迹长度[0,1]值越大，尾迹越长重
          symbol: 'path://M887.146 744.846c-0.944 0.944-2.003 1.781-3.171 2.494-5.107 3.11-11.473 3.299-16.753 0.5l-288.12-152.675-12.34 149.396 120.159 118.202c3.202 3.15 5.025 7.444 5.063 11.935l0.358 40.4c0.051 5.759-2.825 11.153-7.638 14.316-4.813 3.165-10.902 3.67-16.169 1.34l-155.351-68.687-166.256 66.342c-5.188 2.070-11.061 1.453-15.704-1.653s-7.461-8.294-7.531-13.88l-0.512-40.39c-0.060-4.859 1.982-9.516 5.565-12.775l127.96-116.011-15.59-153.005-292.411 151.455c-5.228 2.707-11.485 2.51-16.53-0.524-5.046-3.032-8.156-8.465-8.219-14.351l-0.812-77.005c-0.052-5.152 2.242-10.045 6.225-13.309l301.236-246.123-0.18-155.287c-0.362-62.141 24.34-96.654 39.242-111.557 0.074-0.074 0.147-0.147 0.221-0.221 13.834-13.834 30.157-21.97 43.523-21.971 32.282-0.001 77.524 46.843 78.4 134.685 0.001 0.062 0.030 0.152 0.029 0.216l-0.126 156.35 293.644 249.862c3.739 3.183 5.918 7.832 5.97 12.741l0.791 77.028c0.047 4.612-1.78 8.982-4.963 12.164zM552.335 556.158c1.127-1.127 2.417-2.102 3.852-2.885 4.999-2.735 11.037-2.776 16.073-0.106l285.656 151.369-0.418-40.801-293.722-249.93c-3.789-3.226-5.97-7.951-5.967-12.926l0.147-164.091c-0.424-40.722-11.383-65.87-20.505-79.796-11.243-17.164-21.909-21.111-23.947-21.167-8.755 0.067-49.522 26.256-49.071 99.71 0.001 0.033 0.001 0.064 0.001 0.097l0.071 163.239c0.004 5.091-2.282 9.914-6.228 13.134l-301.152 246.058 0.437 41.311 290.088-150.25c4.987-2.581 10.923-2.529 15.863 0.142 4.938 2.669 8.233 7.611 8.801 13.192l18.988 186.33c0.547 5.36-1.491 10.649-5.478 14.28l-128.645 116.633 0.103 8.073 149.953-59.839c4.236-1.69 8.971-1.602 13.14 0.243l137.831 60.94-0.063-7.099-120.818-118.851c-3.587-3.528-5.421-8.468-5.005-13.48l15.112-182.932c0.333-4.052 2.105-7.792 4.909-10.594z', //箭头图标
          symbolSize: 20, //图标大小,
          color: 'white'
        },
        // 设置线条数据
        data: [
          {
            coords: [//一个包含两个到多个二维坐标的数组。在 polyline 设置为 true 时支持多于两个的坐标。
              [115.892151, 28.676493],// 起点
              [116.405285, 39.904989],// 终点
            ],
          },
          {
            coords: [
              [116.405285, 39.904989],  // 起点
              [114.298572, 30.584355]   // 终点

            ],
          },
          {
            coords: [
              [91.132212, 29.660361],  // 起点
              [116.405285, 39.904989]   // 终点
            ],
          },
          {
            coords: [
              [116.405285, 39.904989],  // 起点
              [126.642464, 45.756967]   // 终点
            ],
          },
          {
            coords: [
              [104.065735, 30.659462],
              [87.617733, 43.792818]
            ]
          },
          {
            coords: [
              [104.065735, 30.659462],
              [121.509062, 25.044332]
            ]
          },
          {
            coords: [
              [104.065735, 30.659462],
              [111.670801, 40.818311]
            ]
          },
          {
            coords: [
              [115.892151, 28.676493],
              [102.712251, 25.040609]
            ]
          },
          {
            coords: [
              [ 116.405285,39.904989],
              [110.33119,20.031971]
            ]
          },
        ],
        lineStyle: {
          color: 'cyan',
          width: 2, //尾迹线条宽度
          opacity: 1, //尾迹线条透明度
          curveness: 0.3, //尾迹线条曲直度
        },
      },

      // 散射坐标点设置
      {
        type: 'effectScatter',
        coordinateSystem: 'geo',
        symbolSize: 10,
        rippleEffect: { //坐标点动画
          period: 3,
          scale: 5,
          brushType: 'fill'
        },
        label: {
            show: true,
            position: 'right',
            formatter: '{b}',
            color: '#f28813',
            fontWeight: "bold",
            fontSize: 14
        },

        data:
          [
            {
              value: [102.712251, 25.040609],
            },
            {
              value: [115.892151, 28.676493],
            },
            {
              value: [111.670801, 40.818311],
            },
            {
              value: [104.065735, 30.659462],
            },
            {
              value: [121.509062, 25.044332],
            },
            {
              value: [87.617733, 43.792818],
            },
            {
              value: [126.642464, 45.756967],
            },
            {
              value: [116.405285, 39.904989],
            },
            {
              value: [91.132212, 29.660361],
            },
            {
              value: [114.298572, 30.584355],
            },
            {
              value: [115.892151, 28.676493],
            },
            {
              value: [110.33119,20.031971]
            },
          ],
        
        showEffectOn: 'render',
 
        hoverAnimation: true,

        itemStyle: {
            color: '#16A5ff',
            shadowBlur: 10,
            shadowColor: '#16A5BB',
        },
        zlevel: 1,
      },
    ]
  })
})
</script>

<style scoped></style>
